posts/lazy-michael.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 10:42 AM on 24 Jan, 2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lazy Michael</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Wang" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
                     <link rel="stylesheet" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/posts">Blog</a></li>
        <li><a href="https://github.com/mwonng">Github</a></li>
    </ul>
</nav>
</div>
<div id="content">
<h1 class="title">Lazy Michael</h1>
<div class="PREVIEW">
<p>
It's literally 5th time to migrate my blog again. This time is migrate from Gatsby.js to Org-mode, I also move to emacs as well with this chance.
</p>

</div>

<div id="outline-container-org0fab4da" class="outline-2">
<h2 id="org0fab4da">Lazy and lazy</h2>
<div class="outline-text-2" id="text-org0fab4da">
<p>
It's literally 5th time to migrate my blog again. This time is migrate from Gatsby.js to Org-mode, I also move to emacs as well with this chance.
</p>
</div>

<div id="outline-container-org2d558ad" class="outline-3">
<h3 id="org2d558ad">Time cost</h3>
<div class="outline-text-3" id="text-org2d558ad">
<p>
We you became a two kids' father and also been the first generation migrant. It's pretty hard to still pay attention to all blog which need update it's security issue and update to the latest version. My old Gatsby still in version 1 so i got the notification a few times to upgrade since 2019. But I do not have such time to upgrade and when i realise i need to upgrade. Gatsby looks like not support upgrade to latest version from v1 directly. I have to do it manually.
</p>
</div>
</div>

<div id="outline-container-org9947d25" class="outline-3">
<h3 id="org9947d25">The good decision i had</h3>
<div class="outline-text-3" id="text-org9947d25">
<p>
Luckily, I have all my blogs stored as markdown format, so i can easily have all the text comes back(although i actually dont have that many blogs).
</p>

<p>
So for this time i prefer not use any blog platform such as Jekyll or Hugo or Next.js. All those would make above experience again. This time as you can see I have all blog stored as org file and export to HTML straight without rely on any other blog platform and i have my css write myself, so no any sercurity issue, everything is static HTML and plant text.
</p>
</div>
</div>
</div>

<div id="outline-container-org6134d71" class="outline-2">
<h2 id="org6134d71">Life recent years</h2>
<div class="outline-text-2" id="text-org6134d71">
</div>
<div id="outline-container-orga653fbf" class="outline-3">
<h3 id="orga653fbf">Work in Oz</h3>
<div class="outline-text-3" id="text-orga653fbf">
<p>
since NAB, I've work for different employers in Australia now. I really appreciate a lot of guys in workplace give me a huge help in the past years especially during Covid.
</p>

<p>
It's really a good experience with all of you guys. I know that's a short period but it's always good with all champions.
</p>
</div>
</div>

<div id="outline-container-org4e59c94" class="outline-3">
<h3 id="org4e59c94">Work from home</h3>
<div class="outline-text-3" id="text-org4e59c94">
<p>
I think it's getting more common WFH now. I'm now WFH mostly of time and it save 2hrs every day and it suits me very well.
</p>
</div>
</div>

<div id="outline-container-orgc61f3dc" class="outline-3">
<h3 id="orgc61f3dc">Frontend focus</h3>
<div class="outline-text-3" id="text-orgc61f3dc">
<p>
Yeah, i was always been working as different roles in the past 10 years. 7 years ago i decide to focus on more frontend and most of my time i still been full-stack. But I think it's better to be a frontend focus dev.
</p>
</div>
</div>

<div id="outline-container-org23e15f3" class="outline-3">
<h3 id="org23e15f3">Happy father, happy life</h3>
<div class="outline-text-3" id="text-org23e15f3">
<p>
Yes happy life. In the end of year and the new year of 2023. I hope I can have more time to write something here and also have more time share with my family.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Posted at 12:00 AM on 10 Jan, 2023 </p>
<p class="author">By Michael Wang</p>
<script src="https://utteranc.es/client.js"
    repo="mwonng/mwonng.github.io"
    issue-term="pathname"
    theme="github-light"
    crossorigin="anonymous"
    async>
</script>
</div>
</body>
</html>
